###################################################################################
# Mentor Graphics Corporation
#
###################################################################################

#################
# Attributes
#################
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(0)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(0)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(0)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(1)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(1)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(1)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(2)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(2)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(2)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(3)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(3)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(3)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(5)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(6)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(7)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(8)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(9)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(10)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(11)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(12)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(13)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(15)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/tap(16)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(0)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(1)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(2)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(4)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(5)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(6)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(7)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(8)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(9)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(10)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(11)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(12)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(14)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(15)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/prod(16)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(0)(0) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(15) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(14) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(13) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(12) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(11) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(10) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(9) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(8) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(7) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(6) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(5) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(4) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(3) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(2) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(1) -design rtl 
set_attribute -name logic_block -value "1" -net -type default low_pass/sum(16)(0) -design rtl 

set_attribute -name PLL_TYPE -value "FAST" -instance -type string u_audio_dac/p1/altpll -design rtl 
set_attribute -name INTENDED_DEVICE_FAMILY -value "Cyclone II" -instance -type string u_audio_dac/p1/altpll -design rtl 
set_attribute -name INCLK0_INPUT_FREQUENCY -value "37037" -instance -type integer u_audio_dac/p1/altpll -design rtl 
set_attribute -name COMPENSATE_CLOCK -value "CLK0" -instance -type string u_audio_dac/p1/altpll -design rtl 
set_attribute -name CLK1_PHASE_SHIFT -value "0" -instance -type string u_audio_dac/p1/altpll -design rtl 
set_attribute -name CLK1_MULTIPLY_BY -value "2" -instance -type integer u_audio_dac/p1/altpll -design rtl 
set_attribute -name CLK1_DUTY_CYCLE -value "50" -instance -type integer u_audio_dac/p1/altpll -design rtl 
set_attribute -name CLK1_DIVIDE_BY -value "3" -instance -type integer u_audio_dac/p1/altpll -design rtl 
set_attribute -name CLK0_PHASE_SHIFT -value "0" -instance -type string u_audio_dac/p1/altpll -design rtl 
set_attribute -name CLK0_MULTIPLY_BY -value "14" -instance -type integer u_audio_dac/p1/altpll -design rtl 
set_attribute -name CLK0_DUTY_CYCLE -value "50" -instance -type integer u_audio_dac/p1/altpll -design rtl 
set_attribute -name CLK0_DIVIDE_BY -value "15" -instance -type integer u_audio_dac/p1/altpll -design rtl 


##################
# Clocks
##################
create_clock { aud_bclk } -domain ClockDomain1 -name aud_bclk -period 4.000000 -waveform { 0.000000 2.000000 } -design rtl 
create_clock { clock_27 } -domain ClockDomain0 -name clock_27 -period 4.000000 -waveform { 0.000000 2.000000 } -design rtl 
create_generated_clock { u_audio_dac/reg_lrck_1x/out } -domain ClockDomain2 -name u_audio_dac_reg_lrck_1x/regout -multiply_by 1  -divide_by 3 -source clock_27 -duty_cycle 50.000000  -design rtl 
create_generated_clock { u_i2c_av_config/reg_m_i2c_ctrl_clk/out } -domain ClockDomain3 -name u_i2c_av_config/reg_m_i2c_ctrl_clk/regout -multiply_by 1  -divide_by 2 -source clock_27 -duty_cycle 50.000000  -design rtl 

